Repository: mubtAAhij/CodeEdit
Catalog: CodeEdit/Localization/Localizable.xcstrings
Source language: en
Languages: es_419, fr_fr, zh_cn

# feedback.add-account-button
source: Add Account
es_419: Agregar cuenta
fr_fr: Ajouter un compte
zh_cn: 添加账户

# feedback.basic-information
source: Basic Information
es_419: Información básica
fr_fr: Informations de base
zh_cn: 基本信息

# feedback.title-prompt-error
source: Please provide a descriptive title for your feedback:
es_419: Proporciona un título descriptivo para tus comentarios:
fr_fr: Veuillez fournir un titre descriptif pour votre retour :
zh_cn: 请为你的反馈提供描述性标题：

# feedback.title-prompt
source: Please provide a descriptive title for your feedback:
es_419: Proporciona un título descriptivo para tus comentarios:
fr_fr: Veuillez fournir un titre descriptif pour votre retour :
zh_cn: 请为你的反馈提供描述性标题：

# feedback.title-example
source: Example: CodeEdit crashes when using autocomplete
es_419: Ejemplo: CodeEdit se cierra inesperadamente al usar autocompletado
fr_fr: Exemple : CodeEdit plante lors de l'utilisation de l'autocomplétion
zh_cn: 示例：使用自动补全时 CodeEdit 崩溃

# feedback.area-prompt-error
source: Which area are you seeing an issue with?
es_419: ¿En qué área estás viendo un problema?
fr_fr: Dans quelle zone rencontrez-vous un problème ?
zh_cn: 您在哪个区域遇到问题？

# feedback.area-prompt
source: Which area are you seeing an issue with?
es_419: ¿En qué área estás viendo un problema?
fr_fr: Dans quelle zone rencontrez-vous un problème ?
zh_cn: 您在哪个区域遇到问题？

# feedback.type-prompt-error
source: What type of feedback are you reporting?
es_419: ¿Qué tipo de comentario estás reportando?
fr_fr: Quel type de retour signalez-vous ?
zh_cn: 您要报告哪种类型的反馈？

# feedback.type-prompt
source: What type of feedback are you reporting?
es_419: ¿Qué tipo de comentario estás reportando?
fr_fr: Quel type de retour signalez-vous ?
zh_cn: 您要报告哪种类型的反馈?

# feedback.describe-issue-prompt-error
source: Please describe the issue:
es_419: Describe el problema:
fr_fr: Veuillez décrire le problème :
zh_cn: 请描述问题：

# feedback.describe-issue-prompt
source: Please describe the issue:
es_419: Describe el problema:
fr_fr: Veuillez décrire le problème :
zh_cn: 请描述问题：

# feedback.describe-issue-example
source: Example: CodeEdit crashes when the autocomplete popup appears on screen.
es_419: Ejemplo: CodeEdit se cierra inesperadamente cuando aparece la ventana emergente de autocompletado en pantalla.
fr_fr: Exemple : CodeEdit plante lorsque la fenêtre d'autocomplétion apparaît à l'écran.
zh_cn: 示例：当自动补全弹出窗口出现在屏幕上时 CodeEdit 崩溃

# feedback.steps-to-reproduce-prompt
source: Please list the steps you took to reproduce the issue:
es_419: Enumera los pasos que seguiste para reproducir el problema:
fr_fr: Veuillez lister les étapes que vous avez suivies pour reproduire le problème :
zh_cn: 请列出您重现该问题所采取的步骤：

# feedback.steps-example-label
source: Example:
es_419: Ejemplo:
fr_fr: Exemple :
zh_cn: 示例：

# feedback.steps-example-1
source: 1. Open the attached sample project
es_419: 1. Abre el proyecto de ejemplo adjunto
fr_fr: 1. Ouvrir l'exemple de projet joint
zh_cn: 1. 打开附件中的示例项目

# feedback.steps-example-2
source: 2. type #import and wait for autocompletion to begin
es_419: 2. escribe #import y espera a que comience el autocompletado
fr_fr: 2. saisir #import et attendre le démarrage de l'autocomplétion
zh_cn: 2. 输入 #import 并等待自动补全开始

# feedback.expectation-prompt
source: What did you expect to happen?
es_419: ¿Qué esperabas que sucediera?
fr_fr: Quel était le comportement attendu ?
zh_cn: 您期望发生什么？

# feedback.expectation-example
source: Example: I expected autocomplete to show me a list of headers.
es_419: Ejemplo: Esperaba que el autocompletado me mostrara una lista de encabezados.
fr_fr: Exemple : je m'attendais à ce que l'autocomplétion affiche une liste d'en-têtes.
zh_cn: 示例：我期望自动补全显示头文件列表。

# feedback.what-happened-prompt
source: What actually happened?
es_419: ¿Qué sucedió en realidad?
fr_fr: Que s'est-il réellement passé ?
zh_cn: 实际发生了什么？

# feedback.what-happened-example
source: Example: The autocomplete window flickered on screen and CodeEdit crashed. See attached crashlog.
es_419: Ejemplo: La ventana de autocompletado parpadeó en pantalla y CodeEdit se cerró inesperadamente. Ver registro de cierre adjunto.
fr_fr: Exemple : La fenêtre d'autocomplétion a clignoté à l'écran et CodeEdit a planté. Voir le journal de plantage ci-joint.
zh_cn: 示例：自动补全窗口在屏幕上闪烁，然后 CodeEdit 崩溃。请查看附加的崩溃日志。

# feedback-model.choose
source: Choose...
es_419: Elegir...
fr_fr: Choisir...
zh_cn: 选择…

# feedback-model.incorrect-behaviour
source: Incorrect/Unexpected Behaviour
es_419: Comportamiento incorrecto/inesperado
fr_fr: Comportement incorrect/inattendu
zh_cn: 不正确/非预期的行为

# feedback-model.application-crash
source: Application Crash
es_419: Cierre inesperado de la aplicación
fr_fr: Plantage de l'application
zh_cn: 应用程序崩溃

# feedback-model.application-slow
source: Application Slow/Unresponsive
es_419: Aplicación lenta o sin respuesta
fr_fr: Application lente/bloquée
zh_cn: 应用程序缓慢/无响应

# feedback-model.other-type
source: Other
es_419: Otro
fr_fr: Autre
zh_cn: 其他

# feedback-model.select-problem-area
source: Please select the problem area
es_419: Selecciona el área del problema
fr_fr: Veuillez sélectionner la zone du problème
zh_cn: 请选择问题区域

# feedback-model.area-project-navigator
source: Project Navigator
es_419: Navegador de proyectos
fr_fr: Navigateur de projet
zh_cn: 项目导航器

# feedback-model.area-debugger
source: Debugger
es_419: Depurador
fr_fr: Débogueur
zh_cn: 调试器

# feedback-model.area-editor
source: Editor
fr_fr: Éditeur
zh_cn: 编辑器

# feedback-model.area-other
source: Other
es_419: Otro
fr_fr: Autre
zh_cn: 其他

# feedback-model.label-project-navigator
source: Project Navigator
es_419: Navegador de proyectos
fr_fr: Navigateur de projet
zh_cn: 项目导航器

# feedback-model.label-debugger
source: Debugger
es_419: Depurador
fr_fr: Débogueur
zh_cn: 调试器

# feedback-model.label-editor
source: Editor
fr_fr: Éditeur
zh_cn: 编辑器

# feedback-model.label-other
source: Other
es_419: Otro
fr_fr: Autre
zh_cn: 其他

# feedback-model.label-other-default
source: Other
es_419: Otro
fr_fr: Autre
zh_cn: 其他

# feedback-model.title-other
source: Other
es_419: Otro
fr_fr: Autre
zh_cn: 其他

# feedback-model.type-bug-crash
source: Bug
es_419: Error
fr_fr: Bogue
zh_cn: 错误

# feedback-model.type-feedback-label
source: Feedback
es_419: Comentarios
fr_fr: Commentaire
zh_cn: 反馈

# feedback-model.type-other-label
source: Other
es_419: Otro
fr_fr: Autre
zh_cn: 其他

# view-commands.show-command-palette
source: Show Command Palette
es_419: Mostrar paleta de comandos
fr_fr: Afficher la palette de commandes
zh_cn: 显示命令面板

# view-commands.open-search-navigator
source: Open Search Navigator
es_419: Abrir navegador de búsqueda
fr_fr: Ouvrir le navigateur de recherche
zh_cn: 打开搜索导航器

# view-commands.font-size-increase
source: Increase
es_419: Aumentar
fr_fr: Agrandir
zh_cn: 增大

# view-commands.font-size-decrease
source: Decrease
es_419: Disminuir
fr_fr: Diminuer
zh_cn: 减小

# view-commands.font-size-reset
source: Reset
es_419: Restablecer
fr_fr: Réinitialiser
zh_cn: 重置

# view-commands.customize-toolbar
source: Customize Toolbar...
es_419: Personalizar barra de herramientas...
fr_fr: Personnaliser la barre d'outils…
zh_cn: 自定义工具栏...

# view-commands.hide-jump-bar
source: Hide Jump Bar
es_419: Ocultar barra de navegación
fr_fr: Masquer la barre de navigation
zh_cn: 隐藏跳转栏

# view-commands.dim-editors-without-focus
source: Dim editors without focus
es_419: Atenuar editores sin foco
fr_fr: Assombrir les éditeurs inactifs
zh_cn: 调暗未聚焦的编辑器

# view-commands.show-navigator
source: Show Navigator
es_419: Mostrar navegador
fr_fr: Afficher le navigateur
zh_cn: 显示导航器

# view-commands.show-inspector
source: Show Inspector
es_419: Mostrar Inspector
fr_fr: Afficher l'inspecteur
zh_cn: 显示检查器

# view-commands.show-utility-area
source: Show Utility Area
es_419: Mostrar área de utilidades
fr_fr: Afficher la zone utilitaire
zh_cn: 显示实用工具区域

# view-commands.show-toolbar
source: Show Toolbar
es_419: Mostrar barra de herramientas
fr_fr: Afficher la barre d'outils
zh_cn: 显示工具栏

# view-commands.show-interface
source: Show Interface
es_419: Mostrar interfaz
fr_fr: Afficher l'interface
zh_cn: 显示界面

# view-commands.hide-interface
source: Hide Interface
es_419: Ocultar interfaz
fr_fr: Masquer l'interface
zh_cn: 隐藏界面

# view-commands.navigators
source: Navigators
es_419: Navegadores
fr_fr: Navigateurs
zh_cn: 导航器

# internal-dev-notifications.icon-type-symbol
source: Symbol
es_419: Símbolo
fr_fr: Symbole
zh_cn: 符号

# internal-dev-notifications.icon-type-text
source: Text
es_419: Texto
fr_fr: Texte
zh_cn: 文本

# internal-dev-notifications.view-button
source: View
es_419: Ver
fr_fr: Affichage
zh_cn: 显示

# internal-dev-notifications.test-notification-title
source: Test Notification
es_419: Notificación de prueba
fr_fr: Notification de test
zh_cn: 测试通知

# internal-dev-notifications.test-notification-description
source: This is a test notification.
es_419: Esta es una notificación de prueba.
fr_fr: Ceci est une notification de test.
zh_cn: 这是一条测试通知。

# internal-dev-notifications.delay-5s
source: Delay 5s
es_419: Retardo 5s
fr_fr: Délai 5 s
zh_cn: 延迟 5 秒

# internal-dev-notifications.sticky
source: Sticky
es_419: Fijo
fr_fr: Épinglé
zh_cn: 固定

# internal-dev-notifications.icon-type
source: Icon Type
es_419: Tipo de ícono
fr_fr: Type d'icône
zh_cn: 图标类型

# internal-dev-notifications.symbol
source: Symbol
es_419: Símbolo
fr_fr: Symbole
zh_cn: 符号

# internal-dev-notifications.random
source: Random
es_419: Aleatorio
fr_fr: Aléatoire
zh_cn: 随机

# internal-dev-notifications.text
source: Text
es_419: Texto
fr_fr: Texte
zh_cn: 文本

# internal-dev-notifications.icon-color
source: Icon Color
es_419: Color del ícono
fr_fr: Couleur de l'icône
zh_cn: 图标颜色

# internal-dev-notifications.title
source: Title
es_419: Título
fr_fr: Titre
zh_cn: 标题

# internal-dev-notifications.action-button
source: Action Button
es_419: Botón de acción
fr_fr: Bouton d'action
zh_cn: 操作按钮

# internal-dev-notifications.add-notification
source: Add Notification
es_419: Agregar notificación
fr_fr: Ajouter une notification
zh_cn: 添加通知

# general-settings.tab-bar-style
source: Tab Bar Style
es_419: Estilo de barra de pestañas
fr_fr: Style de la barre d'onglets
zh_cn: 标签栏样式

# general-settings.show-jump-bar
source: Show Jump Bar
es_419: Mostrar barra de navegación
fr_fr: Afficher la barre de navigation
zh_cn: 显示跳转栏

# general-settings.dim-editors-without-focus
source: Dim editors without focus
es_419: Atenuar editores sin foco
fr_fr: Assombrir les éditeurs inactifs
zh_cn: 调暗未聚焦的编辑器

# general-settings.automatically-save-change-to-disk
source: Automatically save change to disk
es_419: Guardar cambios en disco automáticamente
fr_fr: Enregistrer automatiquement les modifications sur le disque
zh_cn: 自动将更改保存到磁盘

# general-settings.automatically-reveal-in-project-navigator
source: Automatically reveal in project navigator
es_419: Mostrar automáticamente en el navegador de proyectos
fr_fr: Révéler automatiquement dans le navigateur de projet
zh_cn: 自动在项目导航器中显示

# general-settings.automatically-check-for-app-updates
source: Automatically check for app updates
es_419: Buscar actualizaciones de la app automáticamente
fr_fr: Rechercher automatiquement les mises à jour de l'app
zh_cn: 自动检查应用更新

# general-settings.include-pre-release-versions
source: Include pre-release versions
es_419: Incluir versiones preliminares
fr_fr: Inclure les versions préliminaires
zh_cn: 包含预发布版本

# general-settings.one-line
source: One Line
es_419: Una línea
fr_fr: Une seule ligne
zh_cn: 单行

# general-settings.up-to-n-lines
source: Up to %d lines
es_419: Hasta %d líneas
fr_fr: Jusqu'à %d lignes
zh_cn: 最多 %d 行

# view-commands.show
source: Show
es_419: Mostrar
fr_fr: Afficher
zh_cn: 显示

# search-settings.extensions-folder
source: Extensions
es_419: Extensiones
zh_cn: 扩展

# common.ok
source: OK
es_419: Aceptar
zh_cn: 好

# notification.action
source: Action
es_419: Acción
zh_cn: 操作

# extensions.menu
source: Extensions
es_419: Extensiones
zh_cn: 扩展

# utility-area.tab.terminal
source: Terminal
zh_cn: 终端

# inspector.history.email-author
source: Email %@
es_419: Enviar correo a %@
zh_cn: 发邮件给 %@

# extensions.window-title
source: Extensions
es_419: Extensiones
zh_cn: 扩展

# editor.menu.structure
source: Structure
es_419: Estructura
zh_cn: 结构

# language-server.linters
source: Linters
zh_cn: 代码检查

# locations.extensions
source: Extensions
es_419: Extensiones
zh_cn: 扩展

# source-control.branches
source: Branches
es_419: Ramas
zh_cn: 分支

# about.version-format
source: Version %@%@ (%@)
es_419: Versión %@%@ (%@)
zh_cn: 版本 %@%@ (%@)

# toolbar.branch-picker.branches
source: Branches
es_419: Ramas
zh_cn: 分支

# settings.invisible-chars.notes
source: Notes
es_419: Notas
zh_cn: 注释

# output.extension-title
source: Extension - %@
es_419: Extensión - %@
zh_cn: 扩展 - %@

# source-control.pull.button
source: Pull
zh_cn: 拉取

# theme.extensions-folder-name
source: Extensions
es_419: Extensiones
zh_cn: 扩展

# source-control.push.button
source: Push
zh_cn: 推送

# source-control.pull-ellipsis
source: Pull...
zh_cn: 拉取...

# commit.email-author
source: Email %@...
es_419: Enviar correo a %@...
zh_cn: 发邮件给 %@...

# commit.cherry-pick
source: Cherry-Pick %@...
zh_cn: 拣选 %@...

# source-control.cherry-pick
source: Cherry-Pick...
zh_cn: 拣选...

# accounts-settings.description
source: Description
es_419: Descripción
zh_cn: 描述

# accounts-settings.ok
source: OK
es_419: Aceptar
zh_cn: 好

# settings-page.navigation
source: Navigation
es_419: Navegación
zh_cn: 导航

# settings-page.terminal
source: Terminal
zh_cn: 终端

# workspace.ok-button
source: OK
es_419: Aceptar
zh_cn: 好

# workspace.ok-button-unstage
source: OK
es_419: Aceptar
zh_cn: 确定

# workspace.ok-button-stash
source: OK
zh_cn: 好

# workspace.ok-button-discard
source: OK
es_419: Aceptar
zh_cn: 好

# accounts-signin.ok-button
source: OK
es_419: Aceptar
zh_cn: 好

# language-server-install.description
source: Description
es_419: Descripción
zh_cn: 描述

# file-inspector.type
source: Type
es_419: Tipo
zh_cn: 类型

# general-settings.file-icon-style-monochrome
source: Monochrome
es_419: Monocromo
zh_cn: 单色

# project-navigator-menu.options
source: Options
es_419: Opciones
zh_cn: 选项

# theme-settings.type
source: Type
es_419: Tipo
zh_cn: 类型

# theme-settings.tokens-section
source: Tokens
zh_cn: 标记

# theme-settings.types
source: Types
es_419: Tipos
zh_cn: 类型

# theme-settings.variables
source: Variables
zh_cn: 变量

# feedback.description-section
source: Description
es_419: Descripción
zh_cn: 描述

# feedback-model.suggestion
source: Suggestion
es_419: Sugerencia
zh_cn: 建议

# feedback-model.area-extensions
source: Extensions
es_419: Extensiones
zh_cn: 扩展

# feedback-model.label-extensions
source: Extensions
es_419: Extensiones
zh_cn: 扩展

# feedback-model.type-bug-behaviour
source: Bug
es_419: Error
zh_cn: 错误

# feedback-model.type-bug-unresponsive
source: Bug
es_419: Error
zh_cn: 错误

# feedback-model.type-suggestion-label
source: Suggestion
es_419: Sugerencia
zh_cn: 建议

# internal-dev-notifications.icon-type-image
source: Image
es_419: Imagen
zh_cn: 图像

# internal-dev-notifications.icon-type-emoji
source: Emoji
zh_cn: 表情符号

# internal-dev-notifications.section-title
source: Notifications
es_419: Notificaciones
zh_cn: 通知

# internal-dev-notifications.emoji
source: Emoji
zh_cn: 表情符号

# internal-dev-notifications.image
source: Image
es_419: Imagen
zh_cn: 图像

# internal-dev-notifications.description
source: Description
es_419: Descripción
zh_cn: 描述
